#include <windows.h>

#include "resource.h"

#include "TetrisDef.h"
#include "TetrisGble.h"
#include "TetrisPro.h"

//////////////////////////////////////////////////////////
//
// 関数名：DefaultBlock
//
// 戻り値：なし
//
// 引　数：なし
//
// 機　能：ブロックデータを配列に格納
//           種類、方向、4×4マップのX座標、Y座標
//
//////////////////////////////////////////////////////////
void DefaultBlock(void)
{
//棒
    Block[0][0][1][0]=1;
    Block[0][0][1][1]=1;
    Block[0][0][1][2]=1;
    Block[0][0][1][3]=1;

    Block[0][1][0][2]=1;
    Block[0][1][1][2]=1;
    Block[0][1][2][2]=1;
    Block[0][1][3][2]=1;

    Block[0][2][1][0]=1;
    Block[0][2][1][1]=1;
    Block[0][2][1][2]=1;
    Block[0][2][1][3]=1;

    Block[0][3][0][2]=1;
    Block[0][3][1][2]=1;
    Block[0][3][2][2]=1;
    Block[0][3][3][2]=1;
//逆N
    Block[1][0][1][0]=2;
    Block[1][0][1][1]=2;
    Block[1][0][2][1]=2;
    Block[1][0][2][2]=2;

    Block[1][1][1][1]=2;
    Block[1][1][2][1]=2;
    Block[1][1][0][2]=2;
    Block[1][1][1][2]=2;

    Block[1][2][1][0]=2;
    Block[1][2][1][1]=2;
    Block[1][2][2][1]=2;
    Block[1][2][2][2]=2;

    Block[1][3][1][1]=2;
    Block[1][3][2][1]=2;
    Block[1][3][0][2]=2;
    Block[1][3][1][2]=2;
//逆L
    Block[2][0][1][0]=3;
    Block[2][0][1][1]=3;
    Block[2][0][0][2]=3;
    Block[2][0][1][2]=3;

    Block[2][1][0][1]=3;
    Block[2][1][1][1]=3;
    Block[2][1][2][1]=3;
    Block[2][1][2][2]=3;

    Block[2][2][1][0]=3;
    Block[2][2][2][0]=3;
    Block[2][2][1][1]=3;
    Block[2][2][1][2]=3;

    Block[2][3][0][0]=3;
    Block[2][3][0][1]=3;
    Block[2][3][1][1]=3;
    Block[2][3][2][1]=3;
//N
    Block[3][0][2][0]=4;
    Block[3][0][1][1]=4;
    Block[3][0][2][1]=4;
    Block[3][0][1][2]=4;

    Block[3][1][0][1]=4;
    Block[3][1][1][1]=4;
    Block[3][1][1][2]=4;
    Block[3][1][2][2]=4;

    Block[3][2][2][0]=4;
    Block[3][2][1][1]=4;
    Block[3][2][2][1]=4;
    Block[3][2][1][2]=4;

    Block[3][3][0][1]=4;
    Block[3][3][1][1]=4;
    Block[3][3][1][2]=4;
    Block[3][3][2][2]=4;
//L
    Block[4][0][1][0]=5;
    Block[4][0][1][1]=5;
    Block[4][0][1][2]=5;
    Block[4][0][2][2]=5;

    Block[4][1][2][0]=5;
    Block[4][1][0][1]=5;
    Block[4][1][1][1]=5;
    Block[4][1][2][1]=5;

    Block[4][2][0][0]=5;
    Block[4][2][1][0]=5;
    Block[4][2][1][1]=5;
    Block[4][2][1][2]=5;

    Block[4][3][0][1]=5;
    Block[4][3][1][1]=5;
    Block[4][3][2][1]=5;
    Block[4][3][0][2]=5;
//山
    Block[5][0][1][0]=6;
    Block[5][0][0][1]=6;
    Block[5][0][1][1]=6;
    Block[5][0][2][1]=6;

    Block[5][1][1][0]=6;
    Block[5][1][0][1]=6;
    Block[5][1][1][1]=6;
    Block[5][1][1][2]=6;

    Block[5][2][0][1]=6;
    Block[5][2][1][1]=6;
    Block[5][2][2][1]=6;
    Block[5][2][1][2]=6;

    Block[5][3][1][0]=6;
    Block[5][3][1][1]=6;
    Block[5][3][2][1]=6;
    Block[5][3][1][2]=6;
//田
    Block[6][0][1][1]=7;
    Block[6][0][2][1]=7;
    Block[6][0][1][2]=7;
    Block[6][0][2][2]=7;

    Block[6][1][1][1]=7;
    Block[6][1][2][1]=7;
    Block[6][1][1][2]=7;
    Block[6][1][2][2]=7;

    Block[6][2][1][1]=7;
    Block[6][2][2][1]=7;
    Block[6][2][1][2]=7;
    Block[6][2][2][2]=7;

    Block[6][3][1][1]=7;
    Block[6][3][2][1]=7;
    Block[6][3][1][2]=7;
    Block[6][3][2][2]=7;
}

//////////////////////////////////////////////////////////
//
// 関数名：NewBlock
//
// 戻り値：なし
//
// 引　数：なし
//
// 機　能：新しいブロックを生成
//
//////////////////////////////////////////////////////////
void NewBlock(void)
{
    BlockX = DEFMAP_X + 3;      // ブロックの位置を指定
    BlockY = DEFMAP_Y + 2;      // ブロックの位置を指定

    Type = rand() * 10 % 7;     // ０～６までのランダム値を取得（ブロックの種類）
    Vctr = rand() * 10 % 4;     // ０～３までのランダム値を取得（ブロックの向き）

    // ランダムで取得した値を元に落下途中用のブロック配列に新しいブロックデータを格納
    SetBlock();

    // 格納したブロックデータを次のブロックとして表示
    SetNext();

    SetBlock();     //FallBlockにこれから出すブロックをいれる
}

//////////////////////////////////////////////////////////
//
// 関数名：SetBlock
//
// 戻り値：なし
//
// 引　数：なし
//
// 機　能：落下途中用のブロック配列に新しいブロックデータを格納
//
//////////////////////////////////////////////////////////
void SetBlock(void)
{
    int i, j;

    // 新しい種類・向きのブロックを落下途中の配列に格納
    for(i = 0; i < 4; i++){
        for(j = 0; j < 4; j++){
            FallingBlock[i][j] = Block[Type][Vctr][i][j];
        }
    }
}

//////////////////////////////////////////////////////////
//
// 関数名：SetNext
//
// 戻り値：なし
//
// 引　数：なし
//
// 機　能：次のブロックを表示
//
//////////////////////////////////////////////////////////
void SetNext()
{
    static int BuffType, BuffVctr;
    int i, j, temp;

    // 落下途中の配列の内容を表示配列に格納する
    for(i = 0; i < 4; i++){
        for(j = 0; j < 4; j++){
            Map[i + 7][j + 1] = FallingBlock[i][j];
        }
    }

    temp     = BuffType;
    BuffType = Type;
    Type     = temp;

    temp     = BuffVctr;
    BuffVctr = Vctr;
    Vctr     = temp;
}

//////////////////////////////////////////////////////////
//
// 関数名：FallBlock
//
// 戻り値： 0 - 着地した
//          1 - 落下中
//         -1 - 積み上がった
//
// 引　数：なし
//
// 機　能：ブロックを落下
//
//////////////////////////////////////////////////////////
int FallBlock(void)
{
    static int Zurasi = SpeedConf();

    // ブロックのＹ座標をインクリメント
    BlockY++;

    // ブロックが重なる（着地する）とき
    if(CheckOverlap() == FALSE){
        BlockY--;

        // 落ちてすぐにくっつかせない処理
        // スペースキーが押されているときに限りすぐ着く
        if((Zurasi < 800) && (OnSpaceFlag != 0)){
            Zurasi += SpeedConf();
            return 0;
        }else{
            Zurasi = SpeedConf();
        }

        // 着地したブロックをマップに固定
        FixBlock();

        // スコア加算
        CalcScore(DeleteCheck());

        // スピード調整
        if(SubLevel != Lines / 10 % 3){
            SubLevel = Lines / 10 % 3;

            SetTimer(hParent, ID_TIMER, SpeedConf(), NULL);

            if(SubLevel != 0){
                Level++;
            }
        }

        // 新しいブロックを生成
        NewBlock();

        if(CheckOverlap() == FALSE){
            return -1;  //新しいブロックを作った瞬間詰まったとき
        }
        return 1;
    }

    //ここで初期化しないと一度しかずらしがきかない
    Zurasi = SpeedConf();

    return 0;
}

//////////////////////////////////////////////////////////
//
// 関数名：FixBlock
//
// 戻り値：なし
//
// 引　数：なし
//
// 機　能：着地したブロックをマップに固定
//
//////////////////////////////////////////////////////////
void FixBlock(void)
{
    int i, j;

    for(i = 0; i < 4; i++){
        for(j = 0; j < 4; j++){
            if(FallingBlock[i][j] != 0){
                Map[BlockX + i][BlockY + j] = FallingBlock[i][j];
            }
        }
    }
}
